QuestZenit.Render = function(){
	var renderData = {
		players: [
			{ 'cash':50000, 'class': 'green', 'date': '12.07.2014', 'name': 'Черемушкин Иван'},
			{ 'cash':100000, 'class': 'lightblue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':2000, 'class': 'blue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':1000, 'class': 'torquous', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':100000, 'class': 'orange', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':47000, 'class': 'red', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':50000, 'class': 'green', 'date': '12.07.2014', 'name': 'Черемушкин Иван'},
			{ 'cash':100000, 'class': 'lightblue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':2000, 'class': 'blue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':1000, 'class': 'torquous', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':100000, 'class': 'orange', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':47000, 'class': 'red', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':50000, 'class': 'green', 'date': '12.07.2014', 'name': 'Черемушкин Иван'},
			{ 'cash':100000, 'class': 'lightblue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':2000, 'class': 'blue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':1000, 'class': 'torquous', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':100000, 'class': 'orange', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':47000, 'class': 'red', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':50000, 'class': 'green', 'date': '12.07.2014', 'name': 'Черемушкин Иван'},
			{ 'cash':100000, 'class': 'lightblue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':2000, 'class': 'blue', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':1000, 'class': 'torquous', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':100000, 'class': 'orange', 'date': '12.07.2014', 'name': 'Черемушкин Иван' },
			{ 'cash':47000, 'class': 'red', 'date': '12.07.2014', 'name': 'Черемушкин Иван' }
		],
		quests: [
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_1.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_2.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_3.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_1.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_2.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_3.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_1.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_2.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_3.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_1.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_2.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			},
			{ 'title': 'Победоносный Кришито',
			'image': 'img/quests/quest_3.jpg',
			'price': '400000',
			'description': 'Нападающий сборной Бразилии  и ФК "Зенит" Xалк одевается в костюм талисмана Зенита и фотографируется с прохожими на Невском',
			'link': '#'
			}
		]
	};

	var render = function (data, destination) {
		var template = $(destination).html();
		Mustache.parse(template);
		return Mustache.render(template, data);
	};
	$("#main-render").html(render(renderData, '#mainTpl'));
	$('#latestQuests').html(render(renderData, '#otherTpl'));
};